# LECTURE # 4 , OCT 13, 2019

In [5]:
import pandas as pd

data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
'year': [2000, 2001, 2002, 2001, 2002, 2003],
'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)

In [6]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [7]:
pd.DataFrame(data, columns=['pop','year','state'])

   pop  year   state
0  1.5  2000    Ohio
1  1.7  2001    Ohio
2  3.6  2002    Ohio
3  2.4  2001  Nevada
4  2.9  2002  Nevada
5  3.2  2003  Nevada

In [12]:
frame=pd.DataFrame(data, columns=['pop','year','state','extra'], index = ["one","two","three","four","five","six"])

In [13]:
frame

       pop  year   state extra
one    1.5  2000    Ohio   NaN
two    1.7  2001    Ohio   NaN
three  3.6  2002    Ohio   NaN
four   2.4  2001  Nevada   NaN
five   2.9  2002  Nevada   NaN
six    3.2  2003  Nevada   NaN

In [14]:
frame.columns

Index(['pop', 'year', 'state', 'extra'], dtype='object')

In [15]:
frame.year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [16]:
frame.loc["one"]

pop       1.5
year     2000
state    Ohio
extra     NaN
Name: one, dtype: object

In [17]:
val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])

In [18]:
val

two    -1.2
four   -1.5
five   -1.7
dtype: float64

In [19]:
frame.extra=val

In [20]:
frame

       pop  year   state  extra
one    1.5  2000    Ohio    NaN
two    1.7  2001    Ohio   -1.2
three  3.6  2002    Ohio    NaN
four   2.4  2001  Nevada   -1.5
five   2.9  2002  Nevada   -1.7
six    3.2  2003  Nevada    NaN

In [23]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
       'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

frame3 = pd.DataFrame(pop)

In [24]:
frame3 # dictionaries ki keys index ban gayen

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [27]:
frame3_up=pd.DataFrame(pop, index = [2001,2002,2003])

In [28]:
frame3_up

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [31]:
pdata = {'Ohio': frame3['Ohio'][:-1],  # ohio k column mein row no 0 se row no -1 tk (last row shamil ni hogi)
        'Nevada': frame3['Nevada'][:2]} # nevada mein 0 se shuru karo aur 3 tk jaao

In [32]:
pdata

{'Ohio': 2000    1.5
 2001    1.7
 Name: Ohio, dtype: float64, 'Nevada': 2000    NaN
 2001    2.4
 Name: Nevada, dtype: float64}

In [33]:
pdata = pd.DataFrame(pdata)
pdata

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4

In [34]:
frame3.index.name = 'year' ; frame3.columns.name = 'state'

In [35]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [36]:
frame3.values

array([[nan, 1.5],
       [2.4, 1.7],
       [2.9, 3.6]])

# 5.2 Essential Functionality

### Reindexing

In [38]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])

In [39]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [40]:
obj2 = obj.reindex(['a','b','c','d','e'])

In [41]:
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [42]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])

In [43]:
obj3.reindex(range(6))

0      blue
1       NaN
2    purple
3       NaN
4    yellow
5       NaN
dtype: object

In [44]:
obj3.reindex(range(6), method='ffill') # forward fill matlab jismein nan ana he usmien ussay oehli wali value forward hojaigi

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [45]:
obj3.reindex(range(6), method='bfill') # yahann ab 1 pr nan ki jagah neechay se value uth k  bacward hojaigi tou masla aik aiga last wali value mein neechay se koi data nai milay ga

0      blue
1    purple
2    purple
3    yellow
4    yellow
5       NaN
dtype: object

In [46]:
#Reindexing on Frame

In [50]:
import  numpy as np

frame = pd.DataFrame(np.arange(9).reshape((3, 3)),
        index=['a', 'c', 'd'],
        columns=['Ohio', 'Texas', 'California'])

In [51]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [52]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])

In [53]:
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [56]:
states = ['Texas', 'Utah', 'California']
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [57]:
states = ['Texas', 'Utah', 'California']
frame2.reindex(columns=states)

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

In [58]:
frame2.reindex(index = ['f','b','a','d','c','g'] , columns=['Texas','Newyork','Utah','California','Bay'])

   Texas  Newyork  Utah  California  Bay
f    NaN      NaN   NaN         NaN  NaN
b    NaN      NaN   NaN         NaN  NaN
a    1.0      NaN   NaN         2.0  NaN
d    7.0      NaN   NaN         8.0  NaN
c    4.0      NaN   NaN         5.0  NaN
g    NaN      NaN   NaN         NaN  NaN

In [61]:
data = pd.DataFrame(np.arange(1,16).reshape((3,5)), columns=['a','b','c','d','e'])
data

    a   b   c   d   e
0   1   2   3   4   5
1   6   7   8   9  10
2  11  12  13  14  15

In [63]:
np.arange(1,16).reshape((3,5))

array([[ 1,  2,  3,  4,  5],
       [ 6,  7,  8,  9, 10],
       [11, 12, 13, 14, 15]])

In [65]:
data = pd.DataFrame(np.arange(1,101).reshape((20,5)), columns=['a','b','c','d','e'])
data

     a   b   c   d    e
0    1   2   3   4    5
1    6   7   8   9   10
2   11  12  13  14   15
3   16  17  18  19   20
4   21  22  23  24   25
5   26  27  28  29   30
6   31  32  33  34   35
7   36  37  38  39   40
8   41  42  43  44   45
9   46  47  48  49   50
10  51  52  53  54   55
11  56  57  58  59   60
12  61  62  63  64   65
13  66  67  68  69   70
14  71  72  73  74   75
15  76  77  78  79   80
16  81  82  83  84   85
17  86  87  88  89   90
18  91  92  93  94   95
19  96  97  98  99  100

In [66]:
data = pd.DataFrame(np.arange(1,101).reshape((20,5)), columns=['a','b','c','d','e'], index = range(1,101,5)) # 1 se 101 tk 5 k difference se
data

     a   b   c   d    e
1    1   2   3   4    5
6    6   7   8   9   10
11  11  12  13  14   15
16  16  17  18  19   20
21  21  22  23  24   25
26  26  27  28  29   30
31  31  32  33  34   35
36  36  37  38  39   40
41  41  42  43  44   45
46  46  47  48  49   50
51  51  52  53  54   55
56  56  57  58  59   60
61  61  62  63  64   65
66  66  67  68  69   70
71  71  72  73  74   75
76  76  77  78  79   80
81  81  82  83  84   85
86  86  87  88  89   90
91  91  92  93  94   95
96  96  97  98  99  100

## list form

In [69]:
data = pd.DataFrame(np.arange(1,101).reshape((20,5)), columns=list('abcde') , index = range(1,101,5)) # 1 se 101 tk 5 k difference se
data

     a   b   c   d    e
1    1   2   3   4    5
6    6   7   8   9   10
11  11  12  13  14   15
16  16  17  18  19   20
21  21  22  23  24   25
26  26  27  28  29   30
31  31  32  33  34   35
36  36  37  38  39   40
41  41  42  43  44   45
46  46  47  48  49   50
51  51  52  53  54   55
56  56  57  58  59   60
61  61  62  63  64   65
66  66  67  68  69   70
71  71  72  73  74   75
76  76  77  78  79   80
81  81  82  83  84   85
86  86  87  88  89   90
91  91  92  93  94   95
96  96  97  98  99  100

In [73]:
list('abcde')

TypeError: 'str' object is not callable

In [71]:
list

'abcde'

In [72]:
list('abcde')

TypeError: 'str' object is not callable

In [74]:
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [75]:
frame2.loc['b'] # hazaron data he aur mghy index ka nam pata he tou mein index k naam se get kr sakti houn

Ohio         NaN
Texas        NaN
California   NaN
Name: b, dtype: float64

In [76]:
frame2.loc['c']['California'] #koi particular value get karni ho

5.0

In [77]:
frame2.loc['c'][2]

5.0

In [78]:
frame2.loc['c']

Ohio          3.0
Texas         4.0
California    5.0
Name: c, dtype: float64

In [79]:
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [80]:
# d se lekar a tk get karna chah rahy hein indexes aur information
# aur california pehle pe ajaye au rpehla last pe ajaye

frame2.loc[::-1,::-1]

   California  Texas  Ohio
d         8.0    7.0   6.0
c         5.0    4.0   3.0
b         NaN    NaN   NaN
a         2.0    1.0   0.0

In [81]:
#iloc last value ko count nahi karta  ; like 


#without iloc
frame2.loc['a':'c']

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0

In [82]:
#now with iloc

frame2.iloc[0:2]

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN

In [83]:
#so

frame2.iloc[0:3]

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0

In [84]:
frame2.loc['b']['Ohio'] = 2
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   2.0    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [86]:
#or

frame2.loc['b'][0] = 3
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   3.0    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [87]:
#now multiple values update karwani hein agar tou 


frame2.loc['b'][[0,2]]=[4,6]
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   4.0    NaN         6.0
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [90]:
#or

frame2.loc['b',[0,2]]=[3,9]
frame2

KeyError: "None of [Int64Index([0, 2], dtype='int64')] are in the [columns]"

In [92]:
# now we want to swapping


frame2.loc['b'][[2,0]]=frame2.loc['b'][[0,2]]

In [93]:
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   6.0    NaN         4.0
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [95]:
frame2['Texas'][1] +5

nan

In [97]:
# type of nan is float

frame4=frame2.copy()
frame4

   Ohio  Texas  California
a   0.0    1.0         2.0
b   6.0    NaN         4.0
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [98]:
frame4['std'] = [4,5,6,7]

In [99]:
frame4

   Ohio  Texas  California  std
a   0.0    1.0         2.0    4
b   6.0    NaN         4.0    5
c   3.0    4.0         5.0    6
d   6.0    7.0         8.0    7

In [100]:
frame2 + frame4

   California  Ohio  Texas  std
a         4.0   0.0    2.0  NaN
b         8.0  12.0    NaN  NaN
c        10.0   6.0    8.0  NaN
d        16.0  12.0   14.0  NaN

In [101]:
frame2 - frame4

   California  Ohio  Texas  std
a         0.0   0.0    0.0  NaN
b         0.0   0.0    NaN  NaN
c         0.0   0.0    0.0  NaN
d         0.0   0.0    0.0  NaN

In [102]:
abs(-4)

4

In [104]:
frame4[frame4>5]

   Ohio  Texas  California  std
a   NaN    NaN         NaN  NaN
b   6.0    NaN         NaN  NaN
c   NaN    NaN         NaN  6.0
d   6.0    7.0         8.0  7.0

In [105]:
frame4.isnull()

    Ohio  Texas  California    std
a  False  False       False  False
b  False   True       False  False
c  False  False       False  False
d  False  False       False  False

In [106]:
frame4.fillna(0)

   Ohio  Texas  California  std
a   0.0    1.0         2.0    4
b   6.0    0.0         4.0    5
c   3.0    4.0         5.0    6
d   6.0    7.0         8.0    7

In [107]:
frame4.fillna(0, inplace=True) # memory location pr change karega

In [108]:
frame4

   Ohio  Texas  California  std
a   0.0    1.0         2.0    4
b   6.0    0.0         4.0    5
c   3.0    4.0         5.0    6
d   6.0    7.0         8.0    7